using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;

namespace WebApplication1.Models
{
    public class DB
    {
        public static List<User> UserList = new List<User>();
        public static List<Recipe> RecipeList = new List<Recipe>();
        public static List<Category> CategoryList = new List<Category>();
        public static string[] product1 = { "1כוס סוכר לבן", "2כוסות מים", "1כפית מיץ לימון"," שערות קדאיף", "30גרם חמאה", "חופן גבינת מוצרלה" };
        public static string[] preparation1= { "מכינים את סירופ הסוכר: מביאים לרתיחה בסיר קטן את הסוכר והמים ומבשלים למשך 10 דקות עד שהנוזל מסמיך מעט. אפשר לחלוט בסיר פרוסה של תפוז או להוסיף כמה טיפות לימון.",
            "כינים את הכנאפה: קוצצים גס בסכין את הקדאיף (כדי שהשערות תהיינה קצרות יותר).",
        "ממיסים את החמאה במיקרו ומוזגים לתוך מחבת קוטר 20 ס”מ."};
        public static string[] product2 = { "1 1/2כוסות סוכר לבן", "1 1/2קמח תופח", "3ביצים L", "1/2כוס שמן קנולה", "1כפית תמצית וניל" };
        public static string[] preparation2 = { "מחממים תנור לחום של  170 מעלות.", "בקערת המערבל מערבבים היטב את כל החומרים" , "משמנים 2 תבניות אינגליש קייק ושופכים לתוכן את הבלילה.", "אופים בערך 35 דקות עד שהקיסם יוצא יבש ועם פירורים בודדים.", "מפזרים מעל העוגות אבקת סוכר." };
        public static string[] product3 = { "גרם חמאה", "1בצל גדול", "כרובית גדולה","1תפוח אדמה בינוני","800מל ציר ירקות" ,"מלח דק"};
        public static string[] preparation3 = { "מכינים את המרק: בסיר גדול ממיסים את החמאה.", "מוסיפים את הבצל הקצוץ ובוחשים בכף עץ עד להתרככות ושקיפות.",
            "מוסיפים לסיר את פרחי הכרובית המופרדים, את תפוח האדמה, ציר הירקות, החלב והמלח.",
            "מביאים לרתיחה, מנמיכים את האש ומבשלים ברתיחה עדינה כ- 30 דקות עד שהכרובית ותפוחי האדמה רכים.",
            "טוחנים את המרק במעבד מזון או בלנדר מוט עד לקבלת מרק אחיד ושמנתי. אם המרק סמיך מדי לטעמכם אפשר להוסיף חלב חם.",
            "מחלקים לקעריות מרק ומניחים מעל את קוביות הגבינה, הן נמסות תוך כדי ערבוב במרק החם." };
        public static string[] product4 = { "100ג או 1/2כוס סוכר לבן", "3ביצים L", "100גרם קמח כוסמין", "כפית אבקת אפייה", "1כפית תמצית וניל", "1כפית גרידת לימון", "1קורט מלח דק" };
        public static string[] preparation4 = { "מחממים תנור ל-180 מעלות, ומרפדים תבנית תנור בנייר אפייה משומן.",
            "מכינים את הבצק: במיקסר עם וו הקצפה שמים ביצים וסוכר ומקציפים במהירות גבוהה עד שמתקבל קצף לבן, סמיך ויציב.",
        "מוסיפים קמח, אבקת אפייה וניל, קליפת לימון ומלח ומקפלים עד שמתקבלת תערובת אחידה.",
        "יוצקים את התערובת לתוך התבנית ומיישרים לשכבה אחידה ודקה בעזרת קלף או פלטה.",
        "אופים במשך 8-10 דקות או עד הזהבה. הרולדה צריכה להיות קפיצית למגע. מצננים לפני המילוי והקישוט."};
        public static string[] product5 = { "1 1/2כוסות קמח לבן", "1שקית אבקת אפייה", "3כפות סוכר לבן", "1קורט מלח דק", "כוס חלב 3%", "2ביצים L", "3כפות שמן קנולה", "1כפית תמצית וניל" };
        public static string[] preparation5 = { "מנפים את הקמח ואבקת האפייה לתוך קערה גדולה. מוסיפים את הסוכר והמלח. מערבבים היטב.",
            "מוסיפים לקערה את הביצים, החלב, השמן ואת תמצית הווניל ומערבלים היטב בעזרת המיקסר.",
        "מוסיפים לקערה את הבננות המעוכות ומערבלים.",
        "וצקים בעזרת מצקת את בלילת הפנקייק על המחבת. מטגנים למשך כ-2 דקות עד שמופיעות בועות על גבי הפנקייק,",
        "מגישים את הפנקייק עם פרוסות בננה וסירופ מייפל או סירופ שוקולד."};
        public static string[] product6 = { "500גרם פתי בר שוקולד", "2מיכלים שמנת מתוקה 38%", "1/2כוס חלב 3%", "500גרם גבינה לבנה 5%", "3כפות סוכר לבן" };
        public static string[] preparation6 = { "מקציפים יחד את כל חומרי המילוי (פרט לגבינת השוקולד מוו והביסקוויטים) עד לקבלת קרם יציב.",
            "מעבירים חצי מכמות הקרם לקערה נוספת, מוסיפים את גבינת השוקולד מוו, ומערבבים היטב.",
        "מניחים בתבנית ביסקוויטים על כל שטח הפנים ומשטחים מעליהם את קרם הווניל.",
        "מסדרים שכבה נוספת של ביסקוויטים ומשטחים מעליהם את קרם השוקולד.",
        "מסדרים מעל שכבה נוספת של ביסקוויטים ומקפיאים למשך כשלוש שעות.",
        "חותכים את העוגה למנות לפי צורת הביסקוויטים העליונים, כך שנוצרת לנו קסטה כפולה, ומגישים."};
        public static string[] product7 = { "1 או 300גרם פירות יער ", "5כפיות ממתיק טרוביה", "1כוס מים קרים" };
        public static string[] preparation7 = { "מכינים את הסורבה: טוחנים את הפירות הקפואים, ממתיק הטרוביה והמים במעבד מזון או בבלנדר מוט ידני." };
        public static string[] product8 = { "2 1/2כוסות מים", "1כוס סוכר לבן", "3/4כוס שמן חמניות" , "2ביצים" };
        public static string[] preparation8 = { "לשים את כל חומרי הבצק במשך 5 דקות במיקסר עם וו לישה (או 10 דקות בידיים)",
            "חותכים 25 ריבועים מנייר אפייה, בגודל 5X5 ס”מ בערך. מחלקים את הבצק ל-25 חלקים,",
        "משמנים את הכדורים מלמעלה בספריי שמן ומכסים בניילון נצמד רופף. ",
        "מחממים בסיר שמן עמוק (השמן צריך להיות בטמפ’ של 160-150 מעלות - חם מאוד אבל לא רותח ומבעבע מדי",
        "מעבירים בכל פעם לסיר כמה כדורי בצק, יחד עם ניירות האפייה שמתחתיהם",
        "מוציאים בזהירות למגש עם נייר סופג. לטיגון טוב, חשוב לא לצופף מדי את הסופגניות בסיר.",
        "מצננים מעט בטמפ’ החדר. מזריקים לכל סופגנייה ריבה במזרק (או חורצים בסכין וממלאים בכפית ריבה).",
        "וזקים לקישוט אבקת סוכר בעזרת מסננת קטנה ומגישים בגאווה! מומלץ ולאכול מיד, כשהסופגניות עדיין חמימות."};
        public static string[] product9 = { "1קג תותים", "4 או 800גרם סוכר לבן", "2כפות מיץ לימון", "3מקלות קינמון בינוניים" };
        public static string[] preparation9 = { "מערבבים תותים וסוכר ומשהים בין חצי שעה ללילה על השיש.",
            "מדליקים את האש מביאים לרתיחה ומבשלים שעה עד 3 שעות על אש קטנה, לפי מידת הסמיכות הרצויה (מומלץ להכניס חצי תפוח לריבה סמיכה במיוחד).",
        "בסוף הבישול מוסיפים מיץ לימון. ממלאים צנצנות מעוקרות בריבה החמה.",
        "סוגרים היטב כל צנצנת, מנגבים שאריות ומעמידים הפוך להצטננות.",
        "שומרים בטמפרטורת החדר ואחרי הפתיחה - במקרר."};
        static DB()
        {


            UserList.Add(new User("david", "nordo", "ayala@gmail.com", "123456"));
            UserList.Add(new User("ayala", "nordo", "david@gmail.com", "234567"));
            CategoryList.Add(new Category("1", "עוגות", "assets/CBake.jpg"));
            CategoryList.Add(new Category("2", "עוגיות", "assets/CCookies.jpg"));
            CategoryList.Add(new Category("3", "קינוחים", "assets/CDessert.jpg"));
            CategoryList.Add(new Category("4", "תבשלים", "assets/CStew.jpg"));

            RecipeList.Add(new Recipe(1, "כנאפה", CategoryList[3], 72, 1, 5, product1, preparation1, 1, "assets/1.jpg"));
            RecipeList.Add(new Recipe(1, "עוגת וניל", CategoryList[1], 60, 2, 5, product2, preparation2, 2, "assets/2.webp"));
            RecipeList.Add(new Recipe(1, "מרק כרובית", CategoryList[3], 80, 3, 5, product3, preparation3, 3, "assets/3.png"));
            RecipeList.Add(new Recipe(1, "רודת קרם מסקרפונה", CategoryList[0], 30, 4, 5, product4, preparation4, 1, "assets/4.webp"));
            RecipeList.Add(new Recipe(1, "פנקייק בננה", CategoryList[2], 75, 5, 5, product5, preparation5, 2, "assets/5.webp"));
            RecipeList.Add(new Recipe(1, "קסטה", CategoryList[2], 30, 1, 5, product6, preparation6, 1, "assets/6.jpg"));
            RecipeList.Add(new Recipe(1, "פירות על מקל", CategoryList[2], 90, 2, 5, product7, preparation7,2, "assets/7.jpg"));
            RecipeList.Add(new Recipe(1, "סופגניות", CategoryList[1], 30, 3, 5, product8, preparation8, 1, "assets/8.webp"));
            RecipeList.Add(new Recipe(1, "ריבת תות", CategoryList[2], 30, 4, 5, product9, preparation9, 2, "assets/9.webp"));
           


        }



    }
}